{
    "buttons" : {
        "continue" : "WELSH - Continue",
        "saveAndContinue" : "WELSH - Save and continue"
    },  

    "checkYourAnswersPage" : {
        "title" : "WELSH - Check your answers before sending your application",
        "lpInfo" : "WELSH - Limited partnership information",
        "change" : "WELSH - Change",
        "headingName" : "WELSH - Partnership Name",
        "headingSic" : "WELSH - Standard Industrial Classification (SIC) code",
        "headingEmail" : "WELSH - Registered email address",
        "headingTerm" : "WELSH - Term of partnership",
        "confirm" : "WELSH - Confirm this statement",
        "futureLawful" : "WELSH - I confirm that the intended future activities of the limited partnership are lawful.",
        "payment" : "WELSH - Continue to payment"
    },

    "emailPage" : {
        "whatIsEmail" : "WELSH - What is the registered email address for the partnership?",
        "emailHint" : "WELSH - Partners must be able to access emails that are sent to this address.",
        "emailUsedFor" : { 
            "title": "WELSH - What is the registered email address used for?",
            "sendInformation": "WELSH - In future we'll use this to send important information that relates to the limited partnership. For example, new legislative requirements or warnings about missed deadlines.",
            "publicRegister": "WELSH - It will not be shown on the public register."
        }
    },

    "chooseRegisteredOfficeAddressPage" : {
         "title": "WELSH - Choose the registered office address",
         "addressLink": "WELSH - The address is not on the list"
        
    },

    "errorPage" : {
        "title" : "WELSH - Sorry, the service is unavailable",
        "tryLater" : "WELSH - You will be able to use the service at a later date.",
        "moreInfo" : "WELSH - Email <a class='govuk-link' href='mailto: enquiries@companieshouse.gov.uk'>enquiries@companieshouse.gov.uk</a>, if you need more information."
    },

    "generalPartnerChoicePage": {
        "title": "WELSH - Is the general partner a person or a legal entity?",
        "hint": "WELSH - You can add more later.",
        "person": "WELSH - A person",
        "legalEntity": "WELSH - A legal entity"
    },

    "generalPartnersPage": {
        "title": "WELSH - You now need to tell us about the general partners",
        "pageInformation": "WELSH - If the partnership has more than one general partner, you'll add them one at a time."
    },

    "limitedPartnerChoicePage" : {
        "isPersonOrLegalEntity" : "WELSH - Is the limited partner a person or a legal entity?",
        "isPersonOrLegalEntityHint" : "WELSH - You can add more later.",
        "person" : "WELSH - A person",
        "legalEntity" : "WELSH - A legal entity"
    },

    "limitedPartnersPage": {
        "title": "WELSH - You now need to tell us about the limited partners",
        "pageInformation": "WELSH - If the partnership has more than one limited partner, you'll add them one at a time."
    },

    "namePage" : {
        "title" : "WELSH - Limited partnership name",
        "whatIsName" : "WELSH - What is the limited partnership name?",
        "whatIsNameHint" : "WELSH - Do not enter a name ending like Limited Partnership or LP. We will add this for you.",
        "existingPartnershipHint" : "WELSH - You must check the name is not the same as an existing partnership or company on the <a href='https://find-and-update.company-information.service.gov.uk/company-name-availability' target='_blank'>Companies House register (opens in a new tab)</a>. If it is, we’ll reject your application.",
        "sensitiveWordHint" : "WELSH - If the name includes <a href='https://www.gov.uk/government/publications/incorporation-and-names/annex-a-sensitive-words-and-expressions-or-words-that-could-imply-a-connection-with-government' target='_blank'>sensitive words or expressions that require approval (opens in a new tab)</a>, you must get permission before you register.",
        "existingTrademarkHint" : "WELSH - You should also use the <a href='https://www.gov.uk/search-for-trademark' target='_blank'>trade mark search (opens in a new tab)</a> to check if your name matches an existing trade mark. If it does, consider choosing a different name. Companies House will not carry out this check for you.",
        "nameEnding" : "WELSH - Which limited partnership name ending would you prefer to go on the public record?",
        "nameEndingHint" : "WELSH - There's no difference between the name endings Limited Partnership, LP and L.P. except how they look.",
        "nameEndingWelshHint" : "WELSH - There's no difference between the name endings Limited Partnership, LP and L.P. except how they look. Partneriaeth Cyfyngedig, PC, and P.C. can only be used if the partnership's principal place of business is in Wales.",

        "privateFund" : {
            "title" : "WELSH - Private fund limited partnership name",
            "whatIsName" : "WELSH - What's the name of the private fund limited partnership?",
            "nameEnding" : "WELSH - Which private fund limited partnership name ending would you prefer to go on the public record?",
    
            "scottish" : {
                "title" : "WELSH - Scottish private fund limited partnership name",
                "whatIsName" : "WELSH - What's the name of the private fund limited partnership?"        
            }    
        },

        "scottish" : {
            "title" : "WELSH - Scottish limited partnership name",
            "whatIsName" : "WELSH - What's the name of the Scottish limited partnership?",
            "nameEnding" : "WELSH - Which name ending would you prefer to go on the public record?"
        },

        "nameErrorMessage": "WELSH - Enter a name for the partnership",
        "nameEndingErrorMessage": "WELSH - Select the name ending to go on the public record"
    },

    "officeAddress": {
        "whatIsOfficeAddress": "WELSH - What is the registered office address of the partnership?",
        "officialCommunication": "WELSH - This is where official communications will be sent.",
        "england": {
            "physicalAddress": "WELSH - It must be a physical address in England, Wales or Northern Ireland. You cannot use a PO Box address.",
            "jurisdiction": "WELSH - The partnership will be registered in the jurisdiction of this address (either England and Wales, or Northern Ireland)."
        },
        "scotland": {
            "physicalAddress": "WELSH - It must be a physical address in Scotland. You cannot use a PO Box address.",
            "jurisdiction": "WELSH - The partnership will be registered in the jurisdiction of this address (Scotland)."
        },
        "nameOrNumberHint": "WELSH - Property name or number (optional)",
        "postcodeHint": "WELSH - Postcode",
        "enterAddressManually": "WELSH - Enter address manually",
        "publicRegister": "WELSH - <h2 class='govuk-heading-m'>What information we'll show on the public register</h2> <p>We'll show the registered office address on the public register.</p>",
        "findAddress": "WELSH - Find address"
    },

    "pageNotFound" : {
        "title" : "WELSH - Page Not Found",
        "spelling" : "WELSH - If you typed the web address, check it is spelled correctly.",
        "copiedAddress" : "WELSH - If you pasted the web address, check you copied the entire address.",
        "movedPage" : "WELSH - If the web address is correct or you selected a link, the page may have moved.",
        "goToStartPage" : "WELSH - To register a limited partnership, go to the <a class='govuk-link' href='/limited-partnerships/start'>Register a limited partnership</a> start page."
    },

    "service" : "WELSH - Register a limited partnership",

    "startPage" : {
        "title" : "Partneriaethau Cyfyngedig yw hyn",
        "errorStartAddressMissing" : "Rhowch gyfeiriad"
    },

    "whatIsYourJurisdiction" : {
        "title" : "WELSH - What is your jurisdiction?",
        "whereIsJurisdiction" : "WELSH - Where is the jurisdiction?",
        "options": {
            "EnglandWales" : "WELSH - England and Wales",
            "NorthernIreland" : "WELSH - Northern Ireland"
        },
        "hint" : "WELSH - This is where the partnership was formed. The registered office address and principal place of business will need to be in the same jurisdiction.", 
        "scotlandHeading" : "WELSH - This partnership will be registered in Scotland",
        "scotlandInformation" : "WELSH - This means the partnership's registered office address and principal place of business will need to be in Scotland. Select to continue, if this is correct.",
        "ifNotScotland" : "WELSH - If these addresses are in England, Wales or Northern Ireland, you will need to go back to change the type of partnership you are registering."
    }, 

    "whichTypePage": {
        "title": "WELSH - Which type of partnership do you want to register?",
        "options": {
            "LP": "WELSH - Limited partnership in England, Wales or Northern Ireland",
            "PFLP": "WELSH - Private fund limited partnership in England, Wales or Northern Ireland",
            "SLP": "WELSH - Scottish limited partnership",
            "SPFLP": "WELSH - Private fund limited partnership in Scotland"
        }
    }   
}
